//================================
//
// リザルト画面
// Author:Teruto Sato
//
//================================
#include "result.h"
#include "input.h"

//============================
// リザルトの初期化処理
//============================
void InitResult(void)
{

}

//============================
// リザルトの終了処理
//============================
void UninitResult(void)
{

}

//============================
// リザルトの更新処理
//============================
void UpdateResult(void)
{

}

//============================
// リザルトの描画処理
//============================
void DrawResult(void)
{

}