//=========================================
// 
// ステージ(ヘッダーファイル)
// Author Tanimoto_Kosuke
//
// Update 22/03/09
// 
//=========================================
#ifndef _STAGE_H_
#define _STAGE_H_

#include "main.h"

//****************************************************************************
//マクロ定義
//****************************************************************************
#define STAGE_WIDTH			(SCREEN_WIDTH)	//ステージの横サイズ
#define STAGE_HEIGHT		(SCREEN_HEIGHT - 200)	//ステージの縦サイズ
#define MAX_STAGE			(2)						//ステージの最大数
#define MAX_IMAGE_STAGE		(2)						//ステージ画像の最大数

//****************************************************************************
//ステージの種類
//****************************************************************************
typedef enum
{
	STAGE_TYPE_FRONT = 0,	//ステージ前側
	STAGE_TYPE_BACK,		//ステージ後ろ側
	STAGE_TYPE_MAX
}STAGE_TYPE;

//****************************************************************************
//構造体の定義
//****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 rot;	//回転
	D3DXVECTOR3 nor;	//法線
	D3DXCOLOR	col;	//色
	STAGE_TYPE type;	//種類
	float fAngle;		//角度(アークタンジェント)
	float fLength;		//長さ(スクウェアルート)
}STAGE;

//****************************************************************************
//プロトタイプ宣言
//****************************************************************************
void InitStage(void);
void UninitStage(void);
void UpdateStage(void);
void DrawStage(void);

#endif