//=========================================
// 
// UI処理
// Author YudaKaito
// 
//=========================================
//------------------------------------
// include
//------------------------------------
#include "ui.h"
#include "score.h"
#include "time.h"
#include "pop.h"

//=========================================
// 初期化
//=========================================
void InitUI(void)
{
	InitScore();		// スコア
	InitTime();			// タイム
	InitPop();			// 得点
}

//=========================================
// 終了
//=========================================
void UninitUI(void)
{
	UninitScore();			// スコア
	UninitTime();			// タイム
	UninitPop();			// 得点
}

//=========================================
// 更新
//=========================================
void UpdateUI(void)
{
	UpdateScore();			// スコア
	UpdateTime();			// タイム
	UpdatePop();			// 得点
}

//=========================================
// 描画
//=========================================
void DrawUI()
{
	DrawScore();		// スコア
	DrawTime();			// タイム
	DrawPop();			// 得点
}